Revit 2027 API
DirectShape.IsValidReferenceCurve Method
 Validates that the input curve is suitable for creating a direct shape reference curve. Bounded and unbounded lines are accepted. Other bounded and unbounded curve types with natural bounds are accepted if they are not closed. Unbounded periodic curves are not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidReferenceCurve(
	Curve curve
)
Public Shared Function IsValidReferenceCurve (
	curve As Curve
) As Boolean
public:
static bool IsValidReferenceCurve(
	Curve^ curve
)
static member IsValidReferenceCurve :
        curve : Curve -> bool
Parameters
curve Curve
 The curve to test.
Return Value
Boolean
 True if the input curve point can be used to create a direct shape reference curve, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace